<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServiceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $services = [
            ['قياس الضغط', 50],
            ['قياس السكر', 40],
            ['تحضير المريض', 100],
            ['إعطاء الدواء', 80],
            ['تنظيف وتعقيم الأدوات', 120],
            ['تسجيل الملاحظات', 60],
            ['المساعدة في العمليات البسيطة', 200],
            ['متابعة العلامات الحيوية', 70],
            ['العناية بالجرح', 90],
            ['إعداد الأدوات الطبية', 110],
            ['متابعة الحالة الصحية', 150],
            ['التواصل مع الأطباء', 100],
            ['التعامل مع الطوارئ', 300],
            ['إدارة ملفات المرضى', 130],
            ['تقديم النصائح للمريض', 75],
            ['الرعاية ما بعد الجراحة', 180],
            ['تغيير الضمادات', 85],
            ['إعطاء المحاليل الوريدية', 120],
            ['سحب العينات الدم', 95],
            ['إعطاء الحقن العضلية', 70],
            ['الرعاية بالقسطرة البولية', 110],
            ['العناية بأسرة المرضى', 65],
            ['التعقيم اليومي للغرفة', 80],
            ['مساعدات التنقل للمريض', 90],
            ['الرعاية النفسية للمريض', 140]
        ];

        foreach ($services as [$name, $price]) {
            \App\Models\Service::create([
                'serv_name' => $name,
                'serv_price' => $price,
            ]);
        }
    }

}
